#+title: Bash programming exercises
#+PROPERTY: header-args :tangle exercise1.sh
#+description:Bash programming exercises from: \
The Complete Guide to Bash Programming,educative.io\\
https://www.educative.io/courses/guide-to-bash-programming

*** Example
Sleep and create a file.
#+begin_src shell :tangle  ./exercises/sleep-and-create-a-file.sh
#sleep-and-create-a-file.sh
  sleep 5
  touch file.txt
#+end_src
#+begin_src shell :tangle ./exercises/check-a-file.sh
#!/bin/bash

# running the file in background 
./sleep-and-create-a-file.sh &

# using while loop to find the file
while [[ ! -e "./file.txt" ]]
do
  echo "File not found";
  sleep 1;
done

echo "File found!!!"
#+end_src

#+RESULTS:
: File found!!!

